<a href="https://colab.research.google.com/github/clearlyCoding/PySpark--Titanic-Dataset/blob/main/Titanic%20DFs.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
!apt-get install openjdk-8-jdk-headless -qq > /dev/null
!wget -q http://archive.apache.org/dist/spark/spark-3.1.1/spark-3.1.1-bin-hadoop3.2.tgz
!tar xf spark-3.1.1-bin-hadoop3.2.tgz
!pip install -q findspark

In [2]:
import os
os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-8-openjdk-amd64"
os.environ["SPARK_HOME"] = "/content/spark-3.1.1-bin-hadoop3.2"

In [3]:
import findspark
findspark.init()
from pyspark.sql import SparkSession
spark = SparkSession.builder.master("local[*]").getOrCreate()
spark.conf.set("spark.sql.repl.eagerEval.enabled", True) # Property used to format output tables better
spark

In [5]:
#load csv
ttnc_df = spark.read.csv("train.csv", header = True, inferSchema=True)
ttnc_df

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| null|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|          382652| 29.125| null|       Q|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|   13.0| null|       S|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|            2649|  7.225| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [7]:
ttnc_df.select('Survived', 'Fare')

+--------+--------+
|Survived|    Fare|
+--------+--------+
|       1| 71.2833|
|       1|   7.925|
|       1|    53.1|
|       1| 11.1333|
|       1| 30.0708|
|       1|    16.7|
|       1|   26.55|
|       1|    16.0|
|       1|    13.0|
|       1|   7.225|
|       1|    13.0|
|       1|  8.0292|
|       1|    35.5|
|       1| 31.3875|
|       1|  7.8792|
|       1|146.5208|
|       1|    7.75|
|       1|  7.2292|
|       1| 11.2417|
|       1| 41.5792|
+--------+--------+
only showing top 20 rows

In [9]:
ttnc_df.select('Survived', 'Fare').where(ttnc_df.Survived == 1)

+--------+--------+
|Survived|    Fare|
+--------+--------+
|       1| 71.2833|
|       1|   7.925|
|       1|    53.1|
|       1| 11.1333|
|       1| 30.0708|
|       1|    16.7|
|       1|   26.55|
|       1|    16.0|
|       1|    13.0|
|       1|   7.225|
|       1|    13.0|
|       1|  8.0292|
|       1|    35.5|
|       1| 31.3875|
|       1|  7.8792|
|       1|146.5208|
|       1|    7.75|
|       1|  7.2292|
|       1| 11.2417|
|       1| 41.5792|
+--------+--------+
only showing top 20 rows

In [15]:
ttnc_df.groupBy('Survived').agg({'Fare':'avg'})

+--------+------------------+
|Survived|         avg(Fare)|
+--------+------------------+
|       1| 48.39540760233917|
|       0|22.117886885245877|
+--------+------------------+

In [17]:
ttnc_df.where(ttnc_df.Sex == 'male').groupBy('Survived').agg({'Fare':'avg'})

+--------+------------------+
|Survived|         avg(Fare)|
+--------+------------------+
|       1| 40.82148440366974|
|       0|21.960992948717944|
+--------+------------------+

In [19]:
ttnc_df.groupBy('Sex','Survived').agg({'Fare':'avg'})

+------+--------+------------------+
|   Sex|Survived|         avg(Fare)|
+------+--------+------------------+
|  male|       0|21.960992948717944|
|female|       1| 51.93857339055791|
|female|       0| 23.02438518518519|
|  male|       1| 40.82148440366974|
+------+--------+------------------+

In [24]:
ttnc_df.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [77]:
from pyspark.sql.functions import when, lit
from pyspark.sql.types import IntegerType, StringType,DoubleType
import math


#creating new dataframe from ttnc2 to turn survived binary to yes no, to make it easier to look at
ttnc_df = ttnc_df.withColumn("Survived", when(ttnc_df.Survived == 0, "No")\
                               .when (ttnc_df.Survived == 1, "Yes")\
                               .otherwise(ttnc_df.Survived))
#creating new dataframe with new column organizing Age Categories
ttnc2_df = ttnc_df.withColumn("AgeType",\
                   when ((ttnc_df.Age <=11), lit('Child'))\
                    .when ((ttnc_df.Age>11) & (ttnc_df.Age<=19), lit('Teenager')) \
                    .when ((ttnc_df.Age >19) & (ttnc_df.Age<=60), lit('Adult')) \
                    .otherwise(lit('Elderly'))\
                    )


ttnc2_df

+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked| AgeType|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+--------+
|          1|      No|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|   Adult|
|          2|     Yes|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|   Adult|
|          3|     Yes|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|   Adult|
|          4|     Yes|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|   Adult|
|          5|      No|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|   Adult|
|          6|      No|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q| Elderly|
|          7|      No|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|   Adult|
|          8|      No|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|   Child|
|          9|     Yes|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|   Adult|
|         10|     Yes|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|Teenager|
|         11|     Yes|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|   Child|
|         12|     Yes|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|   Adult|
|         13|      No|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|   Adult|
|         14|      No|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| null|       S|   Adult|
|         15|      No|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|Teenager|
|         16|     Yes|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|   Adult|
|         17|      No|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|          382652| 29.125| null|       Q|   Child|
|         18|     Yes|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|   13.0| null|       S| Elderly|
|         19|      No|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|   Adult|
|         20|     Yes|     3|Masselmani, Mrs. ...|female|null|    0|    0|            2649|  7.225| null|       C| Elderly|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+--------+
only showing top 20 rows

In [168]:
import pyspark
from pyspark.sql.functions import col

#Organizing Dataframe
ttnc3_df = ttnc2_df.groupBy('Sex', 'AgeType', 'Survived').agg({'Fare':'avg'}).sort(col('Sex').desc(), col('Survived').desc(), col('AgeType'))
#rename columns
newCols=["Sex", "AgeType", "Survived", "AverageFare"]
ttnc3_df = ttnc3_df.toDF(*newCols)
#average fares
ttnc3_df = ttnc3_df.withColumn('AverageFare', pyspark.sql.functions.round(ttnc3_df['AverageFare'],2))

ttnc3_df

+------+--------+--------+-----------+
|   Sex| AgeType|Survived|AverageFare|
+------+--------+--------+-----------+
|  male|   Adult|     Yes|      48.31|
|  male|   Child|     Yes|      36.78|
|  male| Elderly|     Yes|      23.18|
|  male|Teenager|     Yes|      26.13|
|  male|   Adult|      No|      21.33|
|  male|   Child|      No|      33.41|
|  male| Elderly|      No|       21.6|
|  male|Teenager|      No|      22.81|
|female|   Adult|     Yes|       61.6|
|female|   Child|     Yes|      22.94|
|female| Elderly|     Yes|      33.53|
|female|Teenager|     Yes|      49.18|
|female|   Adult|      No|      20.24|
|female|   Child|      No|      35.29|
|female| Elderly|      No|      23.98|
|female|Teenager|      No|      16.49|
+------+--------+--------+-----------+

In [ ]:
ttnc_survivors = ttnc3_df.where(ttnc3_df.Survived == 'Yes')
average_male_cost_survivor = ttnc_survivors.where(ttnc_survivors.Sex == 'male').agg({'AverageFare':'avg'}).head()[0]
# average_male_count_survivor = 
Survivors_df = ttnc_df.where(ttnc_df.Survived == 1)
Survivors_df.show()
MaleSurvivors_df = Survivors_df.where(Survivors_df.Sex == 'male')
MaleSurvivors_df.show()
average_female_cost_survivor = ttnc_survivors.where(ttnc_survivors.Sex == 'female').agg({'AverageFare':'avg'}).head()[0]
print(f"The average price for the {average_male_count_survivor} Men that survived, : $ %.2f" % average_male_cost_survivor)
print("The average price for Women that survived, : $ %.2f" % average_female_cost_survivor)
ttnc3_df.where(ttnc3_df.Survived =='No').show()